{
  "basics": {
    "name": "Matteo Vitolo",
    "label": "Engineering Manager",
    "image": "",
    "email": "matteo.vitolo@gmail.com",
    "phone": "+39 348 5631 136",
    "url": "http://matteovitolo.com",
    "summary": "Engineer Manager and Developer with more than 10 years of experience in the Telecommunications, Fintech and Cloud Services industries. A huge passion for IT and all the techie stuff, enthusiastically a player of this innovation era. Going agile, I can now effectively organise teams’ projects schedule and activities. A Purposeful and positive team player, I like to bring fun to work while building a strong team spirit.",
    "location": {
      "address": "Via Taegio 10",
      "postalCode": "27100",
      "city": "Pavia",
      "countryCode": "IT",
      "region": "PV"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "mvitolo",
        "url": " https://github.com/mvitolo"
      }
    ]
  },
  "work": [
    {
      "name": "Moneyfarm",
      "position": "Engineering Lead",
      "url": "https://moneyfarm.com",
      "startDate": "2022-10-01",
      "summary": "Moneyfarm is an independent FinTech company.",
      "highlights": [
        "The main duty for this role is to lead a cross platform team developing Financial Products and oversee the smooth and efficient running of port equipment, and has oversight over each phase of maintenance. I have been working on the agile processes trying to increase confidence in the forecasted dates and quality while working on the architectural side looking for delivery high standard quality key initiatives."
      ]
    },
    {
      "name": "Moneyfarm",
      "position": "Agile Delivery Manager",
      "url": "https://moneyfarm.com",
      "startDate": "2022-01",
      "endDate": "2022-10",
      "summary": "Moneyfarm is an independent FinTech company.",
      "highlights": [
        "Since 2022 I have been working as Delivery Manager managing three teams, all of them customer-facing. We have been working on moving the whole company team to Kanban and working with Team Metrics (WIP, Cycle Time, and Throughput) to stabilise the teams and gain more confidence and predictability. Part of this job was related to augmenting the agile culture of the team and the whole company. I have designed and conducted workshops and lessons to help the teams to perform better and have a more efficient flow."
      ]
    },
    {
      "name": "Moneyfarm",
      "position": "Senior Mobile Developer and Tech Lead",
      "url": "https://moneyfarm.com",
      "startDate": "2022-01",
      "endDate": "2022-10",
      "summary": "Moneyfarm is an independent FinTech company.",
      "highlights": [
        "Working on the iOS App of the Moneyfarm product to add features and improve the User experience. Part of the job is to improve internal processes to bring incremental value to the user while keeping high standards and quality. I have been working with several teams to improve the workflow with the kanban and agile principles. I am in charge of the release processes for the iOS App."
      ]
    },
    {
      "name": "Vodafone",
      "position": "Senior Mobile Developer and Tech Lead",
      "url": "https://www.vodafone.it/",
      "startDate": "2018-01",
      "endDate": "2019-12",
      "summary": "Vodafone is one of the world's leading telecommunications groups.",
      "highlights": [
        "I’m in charge of the rewriting of both iOS and Android MyVodafone App for the Italian market, bringing the good developing practices inside the team and improving the whole team's commitment on the agile methodologies. Doing this I am coordinating a group of mobile developers (remotely and locally)."
      ]
    },
    {
      "name": "Funambol",
      "position": "Senior Mobile Developer and Tech Lead",
      "url": "https://funambol.com/",
      "startDate": "2007-02",
      "endDate": "2018-02",
      "summary": "Funambol is a leader company in white-label personal cloud solutions.",
      "highlights": [
        "As a Senior Mobile Software Engineer, I was in charge of designing the architecture of the iOS App and choosing the best practices and patterns to apply to the code. Most of the work in my last years in Funambol was organising the team, doing most of the Scrum Master role and duties, and working directly on code and product. I have been an active contributor on the Android App too."
      ]
    },
    {
      "name": "B.L.S. Consulting",
      "position": "Software Engineer",
      "url": "https://www.bls.it/",
      "startDate": "2006-12",
      "endDate": "2005-08",
      "summary": "B.L.S. is an Internet security consulting company.",
      "highlights": [
        "Working on a service acting as interface to the iptables framework on Linux."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Pavia",
      "url": "https://web.unipv.it/",
      "studyType": "Master’s Degree in Computer Engineering",
      "endDate": "2005"
    },
    {
      "institution": "University of Pavia",
      "url": "https://web.unipv.it/",
      "studyType": "Bachelor’s Degree in Computer Engineering",
      "endDate": "2003"
    }
  ],
  "certificates": [
    {
      "name": "KMPII (KSI) (Kanban System Improvement)",
      "date": "2022",
      "issuer": "Kanban University",
      "url": "https://kanban.university/"
    },
    {
      "name": "KMPI (KSD) (Kanban System Design)",
      "date": "2020",
      "issuer": "Kanban University",
      "url": "https://kanban.university/"
    },
    {
      "name": "Scrum Master Certification",
      "date": "2017",
      "issuer": "ScrumAlliance",
      "url": "https://www.scrumalliance.org/"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "C1"
    },
    {
      "language": "Italian",
      "fluency": "Native"
    }
  ],
  "projects": [
    {
      "name": "PTActiv App",
      "summary": "Since 2015 I am in charge of the iOS app of the PTActiv website. This is a website that aims to handle booking reservations for tennis courts. In 2020 we have migrated the app completely to Flutter and I am in charge of both iOS and Android apps.",
      "keywords": [
        "Flutter"
      ],
      "url": "https://www.ptactiv.net/",
      "type": "application"
    },
    {
      "name": "Schedina App",
      "summary": "In 2017 I created a little app for betting, without any money, on the Serie A results and competing in a group. I have created the Backend working on the serverless service of Firebase, including push notification, remote DB, Cloud Functions, and Crash reporting.",
      "keywords": [
        "Flutter",
        "Firebase",
        "Cloud Functions",
        "Serverless"
      ],
      "url": "https://unoxdue.it/",
      "type": "application"
    },
    {
      "name": "TongueOMeter",
      "summary": "From 2019 I am in charge of both iOS and Android companion app for the Tongueometer devices. Tongueometer is a device that helps reeducate people with Swallowing disorders. The device is available only in the U.S.A.",
      "keywords": [
        "Flutter",
        "Bluetooth"
      ],
      "url": "https://e2scientific.com/",
      "type": "application"
    }
  ]
}