{
  "basics": {
    "name": "Matteo Vitolo",
    "label": "Engineering Manager",
    "image": "",
    "email": "matteo.vitolo@gmail.com",
    "phone": "+39 348 5631 136",
    "url": "http://matteovitolo.com",
    "summary": "Results-oriented Engineering Manager with multiple years of experience in managing and overseeing engineering projects across [industry/sector]. Strong technical background combined with excellent leadership and communication skills. Proven ability to effectively coordinate cross-functional teams and develop solutions to complex engineering challenges. Adept at developing and implementing strategies to optimize productivity, quality, and efficiency.",
    "location": {
      "address": "Via Taegio 10",
      "postalCode": "27100",
      "city": "Pavia",
      "countryCode": "IT",
      "region": "PV"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "mvitolo",
        "url": " https://github.com/mvitolo"
      }
    ]
  },
  "work": [
    {
      "name": "Moneyfarm",
      "position": "Engineering Manager",
      "url": "https://moneyfarm.com",
      "startDate": "2020-01",
      "summary": "Moneyfarm is an independent FinTech company.",
      "highlights": [
        "Led a team of seven engineers, a product owner and a designer, overseeing all aspects of project planning, execution, and delivery.",
        "Released on time two of the biggest key initiatives in the company, Thematics and Insurance, creating AUM of multiple million",
        "Developed and implemented agile processes and standards to improve efficiency and quality with scrum and kanban methodologies.",
        "Collaborated with cross-functional teams, including design, production, and quality assurance, to ensure seamless project execution.",
        "Improved team morale and productivity through effective communication and collaboration.",
        "Coaching and mentoring team members to help them grow as engineers."
      ]
    },
    {
      "name": "Vodafone",
      "position": "Engineer Lead",
      "url": "https://www.vodafone.it/",
      "startDate": "2018-01",
      "endDate": "2019-12",
      "summary": "Vodafone is one of the world's leading telecommunications groups.",
      "highlights": [
        "Led a team of eight engineers overseeing all aspects of project planning, execution, and delivery.",
        "Release to more than 5 million customers the new Vodafone App with a new UI/UX.",
        "Coordinated with external vendors and suppliers to ensure timely delivery of materials and equipment, optimizing project timelines and reducing costs.",
        "Conducted regular team meetings to foster collaboration, share best practices, and identify areas for improvement.",
        "Acted as a technical expert, providing guidance and support to team members on complex engineering issues."
      ]
    },
    {
      "name": "Funambol",
      "position": "Senior Mobile Developer and Tech Lead",
      "url": "https://funambol.com/",
      "startDate": "2007-02",
      "endDate": "2018-02",
      "summary": "Funambol is a leader company in white-label personal cloud solutions.",
      "highlights": [
        "Led the design and architecture of the iOS App, ensuring the selection of optimal coding practices and patterns.",
        "Assumed a pivotal role in team organization, effectively taking on Scrum Master responsibilities to streamline project management.",
        "Directly involved in code development and product enhancement, maintaining hands-on involvement in project execution.",
        "Actively contributed to the Android App, demonstrating versatility and a commitment to cross-platform expertise."
      ]
    },
    {
      "name": "B.L.S. Consulting",
      "position": "Software Engineer",
      "url": "https://www.bls.it/",
      "startDate": "2005-08",
      "endDate": "2006-12",
      "summary": "B.L.S. is an Internet security consulting company.",
      "highlights": [
        "Working on a service acting as interface to the iptables framework on Linux."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Pavia",
      "url": "https://web.unipv.it/",
      "studyType": "Master’s Degree in Computer Engineering",
      "endDate": "2006"
    },
    {
      "institution": "University of Pavia",
      "url": "https://web.unipv.it/",
      "studyType": "Bachelor’s Degree in Computer Engineering",
      "endDate": "2003"
    }
  ],
  "certificates": [
    {
      "name": "KMPII (KSI) (Kanban System Improvement)",
      "date": "2022-01",
      "issuer": "Kanban University",
      "url": "https://kanban.university/"
    },
    {
      "name": "KMPI (KSD) (Kanban System Design)",
      "date": "2020-01",
      "issuer": "Kanban University",
      "url": "https://kanban.university/"
    },
    {
      "name": "Scrum Master Certification",
      "date": "2017-01",
      "issuer": "ScrumAlliance",
      "url": "https://www.scrumalliance.org/"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "C1"
    },
    {
      "language": "Italian",
      "fluency": "Native"
    }
  ],
  "projects": [
    {
      "name": "PTActiv App",
      "summary": "Since 2015 I am in charge of the iOS app of the PTActiv website. This is a website that aims to handle booking reservations for tennis courts. In 2020 we have migrated the app completely to Flutter and I am in charge of both iOS and Android apps.",
      "keywords": [
        "Flutter"
      ],
      "url": "https://www.ptactiv.net/",
      "type": "application"
    },
    {
      "name": "Schedina App",
      "summary": "In 2017 I created a little app for betting, without any money, on the Serie A results and competing in a group. I have created the Backend working on the serverless service of Firebase, including push notification, remote DB, Cloud Functions, and Crash reporting.",
      "keywords": [
        "Flutter",
        "Firebase",
        "Cloud Functions",
        "Serverless"
      ],
      "url": "https://unoxdue.it/",
      "type": "application"
    },
    {
      "name": "TongueOMeter",
      "summary": "From 2019 I am in charge of both iOS and Android companion app for the Tongueometer devices. Tongueometer is a device that helps reeducate people with Swallowing disorders. The device is available only in the U.S.A.",
      "keywords": [
        "Flutter",
        "Bluetooth"
      ],
      "url": "https://e2scientific.com/",
      "type": "application"
    }
  ]
}
